/*
 * Copyright (c) HiSilicon (Shanghai) Technologies Co., Ltd. 2019-2019. All rights reserved.
 * Description: Header file for wal_event_msg.c.
 */

#ifndef __WAL_EVENT_MSG_H__
#define __WAL_EVENT_MSG_H__

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "oal_ext_if.h"
#include "wlan_mib_hcm.h"
#include "frw_ext_if.h"

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define WAL_BW_STR_MAX_LEN              20

/*****************************************************************************
  4 枚举定义
*****************************************************************************/
/*****************************************************************************
  5 STRUCT定义
*****************************************************************************/
#ifdef __cplusplus
#if __cplusplus
    }
#endif
#endif

#endif /* end of wal_event_msg.h */
